#Найти и вывести на экран квадраты и кубы чисел от 2 до 5.
for i in range(2, 6):
    print(i, 'квадрат числа: ', i ** 2, 'Куб числа', i ** 3 )